amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/getObjectsInBucket.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.getObjectsinbucket">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:accessKeyId>AKIAIGURZM7GJ7TRO6KQ</urn:accessKeyId>
      <urn:secretAccessKey>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</urn:secretAccessKey>
      <urn:methodType>GET</urn:methodType>
      <urn:contentType>application/xml</urn:contentType>
      <urn:bucketName>imagesBucket5</urn:bucketName>
      <urn:xAmzDate>true</urn:xAmzDate>
      <urn:xAmzSecurityToken/>
      <urn:contentMD5/>
      <urn:bucketUrl>http://s3.amazonaws.com/imagesBucket5</urn:bucketUrl>
      <urn:host>s3.amazonaws.com</urn:host>
      <urn:expect/>
      <urn:prefix/>
      <urn:max-keys>1000</urn:max-keys>
      <urn:delimiter>None</urn:delimiter>
   </soapenv:Body>
</soapenv:Envelope>